#include <iostream>
#include <cmath>
using namespace std;

int main(){
    /*
    Сложность алгоритмов зависит от:
    > размера обрабатываемых данных
    > количества элементарных операций
    > асимптотического анализа

    O - верхняя граница времени, макс время на испольнение программы
    Ω - нижняя граница времени, минимальное время на выолнение программы
    Среднее время выполнения программы

    Постоянное время: O(1)
    Линейное время: O(N)
    Логарифмическое время: O(log ⁡N)
    Линейно-логарифмическое время: O(N * log ⁡N)
    Квадратичное время: O(N^2)
    */
    return 0;
}